In [14]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from pydataset import data
import env
from env import host,user, password
import os

SyntaxError: Missing parentheses in call to 'print'. Did you mean print('Importer: None, set appropriate PYTHONPATH if you see error')? (env.py, line 24)

In [15]:
import env

SyntaxError: Missing parentheses in call to 'print'. Did you mean print('Importer: None, set appropriate PYTHONPATH if you see error')? (env.py, line 24)

In [16]:
# Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.
# Use your function to obtain a connection to the employees database.
# Once you have successfully run a query:
# a. Intentionally make a typo in the database url. What kind of error message do you see?
# b. Intentionally make an error in your SQL query. What does the error message look like?
# Read the employees and titles tables into two separate DataFrames.
# How many rows and columns do you have in each DataFrame? Is that what you expected?
# Display the summary statistics for each DataFrame.
# How many unique titles are in the titles DataFrame?
# What is the oldest date in the to_date column?
# What is the most recent date in the to_date column?

In [17]:
# protocol://[user[:password]@]hostname/[database_name]

In [18]:
mysql+pymysql://codeup:p@assw0rd@data@codeup.com/some_db

SyntaxError: invalid syntax (2432794590.py, line 1)

In [19]:
url = f'mysql+pymysql://{user}:{password}@{host}/employees'

NameError: name 'user' is not defined

In [20]:
sql = '''
SELECT
    emp_no,
    first_name,
    last_name
FROM employees
WHERE gender = 'F'
LIMIT 100
'''

employees = pd.read_sql(sql, url)
employees.head()

NameError: name 'url' is not defined

In [21]:
np.random.seed(898)

In [22]:
import os

In [23]:
os.path.exists('env.py')

False

In [5]:

url = f'mysql+pymysql://{etclark3}

SyntaxError: Missing parentheses in call to 'print'. Did you mean print('Importer: None, set appropriate PYTHONPATH if you see error')? (env.py, line 24)

In [2]:
def get_db_url:
    if env__file:
        user = env.etclark3
        password = env.password
        host = env.data.codeup.com

NameError: name 'env' is not defined

In [13]:
query = '''SELECT * FROM employees limit 10'''

In [14]:
pd.read_sql(query, get_db_url('employees'))

NameError: name 'get_db_url' is not defined

In [ ]:
# Exercise Part 2
# Copy the users and roles DataFrames from the examples above. 
# What is the result of using a right join on the DataFrames?
# What is the result of using an outer join on the DataFrames?
# What happens if you drop the foreign keys from the DataFrames and try to merge them?
# Load the mpg dataset from PyDataset.
# Output and read the documentation for the mpg dataset.
# How many rows and columns are in the dataset?
# Check out your column names and perform any cleanup you may want on them.
# Display the summary statistics for the dataset.
# How many different manufacturers are there?
# How many different models are there?
# Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.
# Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.
# Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.
# Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?
# Do automatic or manual cars have better miles per gallon?

In [7]:
# Create the users DataFrame.
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [8]:
# Create the roles DataFrame
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [10]:
users.merge(roles)

Empty DataFrame
Columns: [id, name, role_id]
Index: []

In [11]:
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [ ]:
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

In [ ]:
# Use your get_db_url function to help you explore the data from the chipotle database.
# What is the total price for each order?
# What are the most popular 3 items?
# Which item has produced the most revenue?
# Join the employees and titles DataFrames together.
# For each title, find the hire date of the employee that was hired most recently with that title.
# Write the code necessary to create a cross tabulation of the number of titles by department. 
# -- (Hint: this will involve a combination of SQL code to pull the necessary data and python/pandas code to perform the manipulations.)